; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v7 ?v5)
             (pred_4 ?v1 ?v12)
             (pred_12 ?v7 ?v12)
             (pred_10 ?v4 ?v7 )
	     (pred_7 ?v7)
             (pred_8 ?v3)
             (pred_1 ?v1)
             (pred_6 ?v12)
             (pred_2 ?v7)
             (pred_11 ?v1)
             (pred_5 ?v7)
             (pred_9 ))



(:action op_1
:parameters (?v8 ?v10 ?v9 ?v6)
:precondition (and (pred_8 ?v8) (pred_8 ?v10) (pred_1 ?v9) (pred_6 ?v6)
          (pred_3 ?v8 ?v10) (pred_4 ?v9 ?v6)
                   (pred_12 ?v10 ?v6) (pred_7 ?v8) 
                   (pred_2 ?v10) (pred_11 ?v9))
:effect (and  (pred_5 ?v10) (not (pred_2 ?v10))))


(:action op_3
:parameters (?v8 ?v2)
:precondition (and (pred_8 ?v8) (pred_8 ?v2)
               (pred_7 ?v8) (pred_3 ?v8 ?v2) (pred_5 ?v2))
:effect (and (pred_7 ?v2) (not (pred_7 ?v8))))

(:action op_2
:parameters (?v8 ?v9)
:precondition (and (pred_8 ?v8) (pred_1 ?v9) 
                  (pred_7 ?v8) (pred_10 ?v9 ?v8) (pred_9 ))
:effect (and (pred_11 ?v9)
   (not (pred_10 ?v9 ?v8)) (not (pred_9 ))))


(:action op_5
:parameters (?v8 ?v13 ?v11)
:precondition (and (pred_8 ?v8) (pred_1 ?v13) (pred_1 ?v11)
                  (pred_7 ?v8) (pred_11 ?v11) (pred_10 ?v13 ?v8))
:effect (and (pred_11 ?v13) (pred_10 ?v11 ?v8)
        (not (pred_11 ?v11)) (not (pred_10 ?v13 ?v8))))

(:action op_4
:parameters (?v8 ?v9)
:precondition (and (pred_8 ?v8) (pred_1 ?v9) 
                  (pred_7 ?v8) (pred_11 ?v9))
:effect (and (pred_9 ) (pred_10 ?v9 ?v8) (not (pred_11 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_23 obj_17 obj_19 obj_18 obj_05 obj_30 obj_28 obj_12 obj_24 obj_16 obj_11 obj_13 obj_09 obj_02 obj_20 obj_01 obj_03 obj_04 obj_29 obj_07 obj_25 obj_10 obj_14 obj_15
    obj_21 obj_06 obj_27
    obj_22 obj_26 obj_31
    )

    (:init
       (pred_9)

       (pred_8 obj_08)
       (pred_8 obj_23)
       (pred_8 obj_17)
       (pred_8 obj_19)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_8 obj_30)
       (pred_8 obj_28)
       (pred_8 obj_12)
       (pred_8 obj_24)
       (pred_8 obj_16)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_09)
       (pred_8 obj_02)
       (pred_8 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_8 obj_29)
       (pred_8 obj_07)
       (pred_8 obj_25)
       (pred_8 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_6 obj_21)
       (pred_6 obj_06)
       (pred_6 obj_27)
       (pred_1 obj_22)
       (pred_1 obj_26)
       (pred_1 obj_31)

       (pred_3 obj_08 obj_05)
       (pred_3 obj_08 obj_23)
       (pred_3 obj_23 obj_30)
       (pred_3 obj_23 obj_17)
       (pred_3 obj_23 obj_08)
       (pred_3 obj_17 obj_28)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_23)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_18 obj_24)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_05 obj_16)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_05 obj_08)
       (pred_3 obj_30 obj_11)
       (pred_3 obj_30 obj_28)
       (pred_3 obj_30 obj_23)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_28 obj_13)
       (pred_3 obj_28 obj_12)
       (pred_3 obj_28 obj_17)
       (pred_3 obj_28 obj_30)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_12 obj_24)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_28)
       (pred_3 obj_24 obj_02)
       (pred_3 obj_24 obj_18)
       (pred_3 obj_24 obj_12)
       (pred_3 obj_16 obj_20)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_16 obj_05)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_11 obj_30)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_13 obj_28)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_09 obj_04)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_02 obj_29)
       (pred_3 obj_02 obj_24)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_20 obj_07)
       (pred_3 obj_20 obj_01)
       (pred_3 obj_20 obj_16)
       (pred_3 obj_01 obj_25)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_20)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_04 obj_14)
       (pred_3 obj_04 obj_29)
       (pred_3 obj_04 obj_09)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_29 obj_15)
       (pred_3 obj_29 obj_02)
       (pred_3 obj_29 obj_04)
       (pred_3 obj_07 obj_25)
       (pred_3 obj_07 obj_20)
       (pred_3 obj_25 obj_10)
       (pred_3 obj_25 obj_01)
       (pred_3 obj_25 obj_07)
       (pred_3 obj_10 obj_14)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_10 obj_25)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_14 obj_04)
       (pred_3 obj_14 obj_10)
       (pred_3 obj_15 obj_29)
       (pred_3 obj_15 obj_14)
       (pred_2 obj_02)
       (pred_2 obj_30)
       (pred_2 obj_18)
       (pred_12  obj_02 obj_21)
       (pred_12  obj_30 obj_06)
       (pred_12  obj_18 obj_27)
       (pred_5 obj_08)
       (pred_5 obj_23)
       (pred_5 obj_17)
       (pred_5 obj_19)
       (pred_5 obj_05)
       (pred_5 obj_28)
       (pred_5 obj_12)
       (pred_5 obj_24)
       (pred_5 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_5 obj_20)
       (pred_5 obj_01)
       (pred_5 obj_03)
       (pred_5 obj_04)
       (pred_5 obj_29)
       (pred_5 obj_07)
       (pred_5 obj_25)
       (pred_5 obj_10)
       (pred_5 obj_14)
       (pred_5 obj_15)

       (pred_4  obj_22 obj_21)
       (pred_4  obj_26 obj_06)
       (pred_4  obj_31 obj_27)
       (pred_10 obj_22 obj_07)
       (pred_10 obj_26 obj_24)
       (pred_10 obj_31 obj_23)
       (pred_7 obj_05)
    )

    (:goal (and
       (pred_10 obj_26 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_13)))
)
)

; plan
1. (op_3 obj_05 obj_08)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_08)
   goals met: 0 of 1
2. (op_3 obj_08 obj_23)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_23)
   goals met: 0 of 1
3. (op_3 obj_23 obj_17)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_17)
   goals met: 0 of 1
4. (op_3 obj_17 obj_28)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_28)
   goals met: 0 of 1
5. (op_3 obj_28 obj_12)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_12)
   goals met: 0 of 1
6. (op_3 obj_12 obj_24)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_24)
   goals met: 0 of 1
7. (op_2 obj_24 obj_26)
   deleted: (pred_10 obj_26 obj_24) (pred_9)
   added: (pred_11 obj_26)
   goals met: 0 of 1
8. (op_3 obj_24 obj_12)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_12)
   goals met: 0 of 1
9. (op_3 obj_12 obj_09)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_09)
   goals met: 0 of 1
10. (op_3 obj_09 obj_04)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_04)
   goals met: 0 of 1
11. (op_3 obj_04 obj_03)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_03)
   goals met: 0 of 1
12. (op_3 obj_03 obj_10)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_10)
   goals met: 0 of 1
13. (op_4 obj_10 obj_26)
   deleted: (pred_11 obj_26)
   added: (pred_9) (pred_10 obj_26 obj_10)
   goals met: 1 of 1
